site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@

** Introduction to Competitive Programming
:PROPERTIES:
:EXPORT_FILE_NAME: introduction_to_competitive_programming
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 4 :date 2022-08-22 :publishdate 2022-07-01
:END:

Welcome to Competitive Programming!  Today we will talk about the benefits of competitive programming, the course structure, and the tools we will
use in the course.

*** Slides
- [[/slides/course-introduction.pdf][Course Introduction Slides]]

*** Judge Links
  - Register on [[https://codeforces.com][Code Forces]].  Your username **will be visible** to other students; you can create a "throwaway"
    account if you want just for this course.
    - Once you are registered, join [[https://codeforces.com/group/vXcw3y5Yhn/contests][the class group]].  This is where your problems will be hosted.
    - Use this [[https://docs.google.com/forms/d/e/1FAIpQLScdDVbkZSqkwEiznyKp_NlCwp0ZRZbOiPfidqcb9Zhi7p_GuQ/viewform?usp=sf_link][google form]] to record your username.

