content/lectures/introduction_to_competitive_programming.md
+++
title = "Introduction to Competitive Programming"
draft = false
weight = 4
date = 2022-08-22
publishdate = 2022-07-01
+++

Welcome to Competitive Programming!  Today we will talk about the benefits of competitive programming, the course structure, and the tools we will
use in the course.


## Slides {#slides}

-   [Course Introduction Slides](/slides/course-introduction.pdf)


## Judge Links {#judge-links}

-   Register on [Code Forces](https://codeforces.com).  Your username ****will be visible**** to other students; you can create a "throwaway"
    account if you want just for this course.
    -   Once you are registered, join [the class group](https://codeforces.com/group/vXcw3y5Yhn/contests).  This is where your problems will be hosted.
    -   Use this [google form](https://docs.google.com/forms/d/e/1FAIpQLScdDVbkZSqkwEiznyKp_NlCwp0ZRZbOiPfidqcb9Zhi7p_GuQ/viewform?usp=sf_link) to record your username.
